
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 21 to add, 1 to change, 21 to destroy.</code></pre>

* Update
  * module.sa_storage_account.azurerm_storage_account.storage_account
* Replace
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]
  * azurerm_storage_blob.b2c_config[&#34;1&#34;]
  * azurerm_storage_blob.b2c_config[&#34;10&#34;]
  * azurerm_storage_blob.b2c_config[&#34;11&#34;]
  * azurerm_storage_blob.b2c_config[&#34;12&#34;]
  * azurerm_storage_blob.b2c_config[&#34;13&#34;]
  * azurerm_storage_blob.b2c_config[&#34;14&#34;]
  * azurerm_storage_blob.b2c_config[&#34;15&#34;]
  * azurerm_storage_blob.b2c_config[&#34;16&#34;]
  * azurerm_storage_blob.b2c_config[&#34;17&#34;]
  * azurerm_storage_blob.b2c_config[&#34;18&#34;]
  * azurerm_storage_blob.b2c_config[&#34;19&#34;]
  * azurerm_storage_blob.b2c_config[&#34;2&#34;]
  * azurerm_storage_blob.b2c_config[&#34;20&#34;]
  * azurerm_storage_blob.b2c_config[&#34;3&#34;]
  * azurerm_storage_blob.b2c_config[&#34;4&#34;]
  * azurerm_storage_blob.b2c_config[&#34;5&#34;]
  * azurerm_storage_blob.b2c_config[&#34;6&#34;]
  * azurerm_storage_blob.b2c_config[&#34;7&#34;]
  * azurerm_storage_blob.b2c_config[&#34;8&#34;]
  * azurerm_storage_blob.b2c_config[&#34;9&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "927796ab4471100bcc4486d56dcf9c7f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/main.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/main.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["1"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "2d511145205655b408407beb2d25a206" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/govuk-frontend-5.2.0.min.css"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["10"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "ff75b23964656ce28eece43f266d9f1d" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-mask.svg"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-mask.svg" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["11"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "57a05afc1fc634420a02ff0151675de0" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-crest-2x.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest-2x.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["12"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "08c923d1fcc2fe3e69e73bfbf539fa6f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-opengraph-image.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-opengraph-image.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["13"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "eef7f360c29c4ef113b058b4d7677550" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-512.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-512.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["14"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "e1321ba525137ed156ed48e69369531c" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/favicon.svg"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.svg" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["15"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "77bfa2d75a6f14154f13588014ee25f6" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/manifest.json"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/manifest.json" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["16"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/bold-b542beb274-v2.woff2"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-b542beb274-v2.woff2" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["17"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/light-f591b13f7d-v2.woff"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-f591b13f7d-v2.woff" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["18"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "94a07e06a104e76fe40583f74b204aee" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/light-94a07e06a1-v2.woff2"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/light-94a07e06a1-v2.woff2" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["19"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "affa96571d94a9ab7d95b0850b26edde" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/fonts/bold-affa96571d-v2.woff"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/fonts/bold-affa96571d-v2.woff" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["2"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "9509139712f25775a153a8cee0d9c736" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "css/govuk-frontend-5.2.0.min.css.map"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/css/govuk-frontend-5.2.0.min.css.map" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["20"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "1c7dad0407e4e48fcd6cdc552fd10861" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/b2c.js"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/b2c.js" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["3"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "7c42cc5ccbfbde50efefdc697bcb4cc9" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/govuk-frontend-5.2.0.min.js.map"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js.map" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["4"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "b20d2e74fe816b4da5e7fc6a26b54b25" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "js/govuk-frontend-5.2.0.min.js"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/js/govuk-frontend-5.2.0.min.js" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["5"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "cfff66539cf6edd54423729830e4129f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "template.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/template.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["6"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "bcd5768bd7721641ee71ba103bb38900" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-crest.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-crest.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["7"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "a90776c99cc9bf3d9dbe593284d6bbf6" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/favicon.ico"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/favicon.ico" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["8"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "ae577696a9d0466ee2019f46ec4c684f" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-180.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-180.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_config["9"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_config" {
      ~ access_tier            = "Hot" -> (known after apply)
      - content_md5            = "2c48a90c9944fc69e87574d06646f3ec" -> null # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "assets/images/govuk-icon-192.png"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/assets/images/govuk-icon-192.png" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "staging"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (39 unchanged attributes hidden)

      ~ blob_properties {
            # (4 unchanged attributes hidden)

          - cors_rule {
              - allowed_headers    = [
                  - "*",
                ] -> null
              - allowed_methods    = [
                  - "GET",
                  - "OPTIONS",
                ] -> null
              - allowed_origins    = [
                  - "https://hmctsdemoextid.b2clogin.com",
                ] -> null
              - exposed_headers    = [
                  - "*",
                ] -> null
              - max_age_in_seconds = 200 -> null
            }

            # (4 unchanged blocks hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 21 to add, 1 to change, 21 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":778,"Program":"tfcmt","SHA1":"","Vars":{}} -->